// 參與人員資料 (flag: 0 主桌) (flag: 1 男方桌) (flag: 2 女方桌)
const weddingData =     [
    {
        "flag":0, 
        "tableName" : "主桌",
        "memberNameList":[
            "新郎",
            "新娘",
            "新郎父",
            "新郎母",
            "新娘父",
            "新娘母",
            "新郎公",
            "新郎嬤",
            "新娘大舅",
            "新娘小舅",
            "新郎大舅",
            "新娘",
            "大伯父"
        ]
    },

    {
        "flag":1, 
        "tableName" : "溪湖桌",
        "memberNameList":[
            "阿嬤",
            "楊宣豪",
            "黃群雅",
            "黃群雅",
            "楊麗真",
            "黃小語",
            "楊淑玉",
            "楊郁淳",
            "楊郁淳",
            "楊郁淳",
            "趙行蘭"
        ]
    },

    {
        "flag":1, 
        "tableName" : "三芝1號桌",
        "memberNameList":[
            "曾二姊",
            "曾三姊",
            "曾三姊",
            "曾三姊",
            "曾三姊",
            "曾三姊",
            "曾三姊",
            "曾欽廷",
            "曾欽廷",
            "阿蓮",
            ""
        ]
    },

    {
        "flag":2, 
        "tableName" : "丁家1號桌",
        "memberNameList":[
            "丁詠育",
            "佳紋嫂嫂",
            "丁姸晴",
            "丁竑皓",
            "丁于涵",
            "蔡佳霖",
            "丁姿瑜",
            "羅伊",
            "官君倪",
            "丁詠軒",
            "李孟真"
        ]
    },

    {
        "flag":2, 
        "tableName" : "丁家2號桌",
        "memberNameList":[
            "堂二姑 (丁月雲)",
            "堂二姑丈 (丁月雲)",
            "堂三姑 (丁月麗)",
            "大伯公",
            "大伯婆",
            "丁福源",
            "丁福源妻",
            "丁福欽女",
            "丁福欽",
            "林雅雰",
            "丁楠鐘"
        ]
    },
];










